haskell/DatabaseHDBC.html

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Examples</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Example - Simple Database Query</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Connect to sqlite3 database 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Database.HDBC</span>
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Database.HDBC.Sqlite3</span> 

<span class="org-haskell-operator">&gt;</span> conn <span class="org-haskell-operator">&lt;-</span> connectSqlite3 <span class="org-string">"zotero.sqlite"</span> 
<span class="org-function-name">conn</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Connection</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Database Metadata
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">-- </span><span class="org-comment">Driver name</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">hdbcDriverName</span> conn
<span class="org-string">"sqlite3"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t hdbcDriverName conn
<span class="org-haskell-definition">hdbcDriverName</span> conn <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">-- </span><span class="org-comment">Version of database server</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">dbServerVer</span> conn
<span class="org-string">"3.14.1"</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t dbServerVer conn
<span class="org-haskell-definition">dbServerVer</span> conn <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Tables metadata 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t getTables 
<span class="org-function-name">getTables</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IConnection</span> conn <span class="org-haskell-operator">=&gt;</span> conn <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> [<span class="org-haskell-type">String</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">getTables</span> conn 
[<span class="org-string">"annotations"</span>,<span class="org-string">"baseFieldMappings"</span>,<span class="org-string">"baseFieldMappingsCombined"</span>,<span class="org-string">"charsets"</span>, <span class="org-haskell-operator">...</span>]


<span class="org-comment-delimiter">-- </span><span class="org-comment">Print all tables available </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">getTables</span> conn <span class="org-haskell-operator">&gt;&gt;=</span> mapM_ putStrLn 
annotations
baseFieldMappings
baseFieldMappingsCombined
charsets
collectionItems
collections
creatorData
creatorTypes
creators
customBaseFieldMappings
customFields
customItemTypeFields
customItemTypes
deletedItems
fieldFormats
fields
fieldsCombined
fileTypeMimeType
<span class="org-haskell-operator">...</span>
tags
transactionLog
transactionSets
transactions
translatorCache
users
version
zoteroDummyTable


<span class="org-comment-delimiter">-- </span><span class="org-comment">Show specific table metadata  </span>
<span class="org-comment-delimiter">--</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">describeTable</span> conn <span class="org-string">"tags"</span>
[(<span class="org-string">"tagID"</span>,<span class="org-haskell-constructor">SqlColDesc</span> {colType <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">SqlIntegerT</span>, colSize <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>,
<span class="org-haskell-definition">colOctetLength</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colDecDigits <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colNullable <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>})<span class="org-haskell-operator">...</span>]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">describeTable</span> conn <span class="org-string">"tags"</span> <span class="org-haskell-operator">&gt;&gt;=</span> mapM_ print

(<span class="org-string">"tagID"</span>,<span class="org-haskell-constructor">SqlColDesc</span> {colType <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">SqlIntegerT</span>, colSize <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colOctetLength <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colDecDigits <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colNullable <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>})
(<span class="org-string">"name"</span>,<span class="org-haskell-constructor">SqlColDesc</span> {colType <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">SqlVarCharT</span>, colSize <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colOctetLength <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colDecDigits <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colNullable <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>})
(<span class="org-string">"type"</span>,<span class="org-haskell-constructor">SqlColDesc</span> {colType <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">SqlIntegerT</span>, colSize <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colOctetLength <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colDecDigits <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colNullable <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>})
(<span class="org-string">"dateAdded"</span>,<span class="org-haskell-constructor">SqlColDesc</span> {colType <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">SqlUnknownT</span> <span class="org-string">"timestamp"</span>, colSize <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colOctetLength <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colDecDigits <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colNullable <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>})
(<span class="org-string">"dateModified"</span>,<span class="org-haskell-constructor">SqlColDesc</span> {colType <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">SqlUnknownT</span> <span class="org-string">"timestamp"</span>, colSize <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colOctetLength <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colDecDigits <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colNullable <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>})
(<span class="org-string">"clientDateModified"</span>,<span class="org-haskell-constructor">SqlColDesc</span> {colType <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">SqlUnknownT</span> <span class="org-string">"timestamp"</span>, colSize <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colOctetLength <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colDecDigits <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colNullable <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>})
(<span class="org-string">"libraryID"</span>,<span class="org-haskell-constructor">SqlColDesc</span> {colType <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">SqlIntegerT</span>, colSize <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colOctetLength <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colDecDigits <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colNullable <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>})
(<span class="org-string">"key"</span>,<span class="org-haskell-constructor">SqlColDesc</span> {colType <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">SqlVarCharT</span>, colSize <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colOctetLength <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colDecDigits <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>, colNullable <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>})
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>



<p>
Quick query 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t quickQuery
<span class="org-haskell-definition">quickQuery</span>
  <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IConnection</span> conn <span class="org-haskell-operator">=&gt;</span>
     conn <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> [<span class="org-haskell-type">SqlValue</span>] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> [[<span class="org-haskell-type">SqlValue</span>]]
<span class="org-haskell-operator">&gt;</span>


<span class="org-comment-delimiter">-- </span><span class="org-comment">Output: formatted manually in order to fit in the screen. </span>
<span class="org-comment-delimiter">--</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">quickQuery</span> conn <span class="org-string">"SELECT tagID, name FROM tags WHERE tagID &gt; 80 LIMIT 15"</span> <span class="org-haskell-constructor">[]</span>

[[<span class="org-haskell-constructor">SqlInt64</span> 81,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"excel"</span>],
 [<span class="org-haskell-constructor">SqlInt64</span> 82,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"spreadsheet"</span>],
 [<span class="org-haskell-constructor">SqlInt64</span> 83,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"vba"</span>],
 [<span class="org-haskell-constructor">SqlInt64</span> 84,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"code"</span>],
 [<span class="org-haskell-constructor">SqlInt64</span> 85,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"thermodynamics"</span>],
 [<span class="org-haskell-constructor">SqlInt64</span> 86,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"mechanical"</span>],
 [<span class="org-haskell-constructor">SqlInt64</span> 87,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"energy"</span>],
 [<span class="org-haskell-constructor">SqlInt64</span> 88,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"catalog"</span>],
 [<span class="org-haskell-constructor">SqlInt64</span> 89,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"parts"</span>],
 [<span class="org-haskell-constructor">SqlInt64</span> 90,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"MVC"</span>],
 [<span class="org-haskell-constructor">SqlInt64</span> 91,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"hydraulics"</span>],
 [<span class="org-haskell-constructor">SqlInt64</span> 92,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"manufacturer"</span>],
 [<span class="org-haskell-constructor">SqlInt64</span> 93,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"design"</span>],
 [<span class="org-haskell-constructor">SqlInt64</span> 94,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"manual"</span>],
 [<span class="org-haskell-constructor">SqlInt64</span> 95,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"cable"</span>]]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> [[<span class="org-haskell-type">SqlValue</span>]]


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">quickQuery</span> conn <span class="org-string">"SELECT tagID, name FROM tags WHERE tagID &gt; 80 LIMIT 15"</span> <span class="org-haskell-constructor">[]</span> <span class="org-haskell-operator">&gt;&gt;=</span> mapM_ print
[<span class="org-haskell-constructor">SqlInt64</span> 81,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"excel"</span>]
[<span class="org-haskell-constructor">SqlInt64</span> 82,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"spreadsheet"</span>]
[<span class="org-haskell-constructor">SqlInt64</span> 83,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"vba"</span>]
[<span class="org-haskell-constructor">SqlInt64</span> 84,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"code"</span>]
[<span class="org-haskell-constructor">SqlInt64</span> 85,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"thermodynamics"</span>]
[<span class="org-haskell-constructor">SqlInt64</span> 86,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"mechanical"</span>]
[<span class="org-haskell-constructor">SqlInt64</span> 87,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"energy"</span>]
[<span class="org-haskell-constructor">SqlInt64</span> 88,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"catalog"</span>]
[<span class="org-haskell-constructor">SqlInt64</span> 89,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"parts"</span>]
[<span class="org-haskell-constructor">SqlInt64</span> 90,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"MVC"</span>]
[<span class="org-haskell-constructor">SqlInt64</span> 91,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"hydraulics"</span>]
[<span class="org-haskell-constructor">SqlInt64</span> 92,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"manufacturer"</span>]
[<span class="org-haskell-constructor">SqlInt64</span> 93,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"design"</span>]
[<span class="org-haskell-constructor">SqlInt64</span> 94,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"manual"</span>]
[<span class="org-haskell-constructor">SqlInt64</span> 95,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"cable"</span>]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>


<p>
Query
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">let</span> query <span class="org-haskell-operator">=</span> unlines <span class="org-haskell-operator">$</span> [
      <span class="org-string">"SELECT fieldName, value FROM itemDataValues, itemData, fields WHERE"</span>, 
      <span class="org-string">"itemDataValues.valueID = itemData.valueID"</span>, 
      <span class="org-string">"and itemData.itemID = 5805"</span>,
      <span class="org-string">"and fields.fieldID = itemData.fieldID"</span>
      ]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">putStrLn</span> query 
<span class="org-haskell-constructor">SELECT</span> fieldName, value <span class="org-haskell-constructor">FROM</span> itemDataValues, itemData, fields <span class="org-haskell-constructor">WHERE</span>
itemDataValues<span class="org-haskell-definition">.</span>valueID <span class="org-haskell-operator">=</span> itemData<span class="org-haskell-operator">.</span>valueID
<span class="org-haskell-definition">and</span> itemData<span class="org-haskell-operator">.</span>itemID <span class="org-haskell-operator">=</span> 5805
<span class="org-haskell-definition">and</span> fields<span class="org-haskell-operator">.</span>fieldID <span class="org-haskell-operator">=</span> itemData<span class="org-haskell-operator">.</span>fieldID

<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t prepare 
<span class="org-function-name">prepare</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IConnection</span> conn <span class="org-haskell-operator">=&gt;</span> conn <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">Statement</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> stmt <span class="org-haskell-operator">&lt;-</span> prepare conn query 
<span class="org-function-name">stmt</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Statement</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t stmt 
<span class="org-function-name">stmt</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Statement</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t execute
<span class="org-function-name">execute</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Statement</span> <span class="org-haskell-operator">-&gt;</span> [<span class="org-haskell-type">SqlValue</span>] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">Integer</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> nrows <span class="org-haskell-operator">&lt;-</span> execute stmt <span class="org-haskell-constructor">[]</span>
<span class="org-function-name">nrows</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Integer</span>
<span class="org-haskell-operator">&gt;</span> nrows
0
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Integer</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">getColumnNames</span> stmt
[<span class="org-string">"fieldName"</span>,<span class="org-string">"value"</span>]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">String</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">========= fetchAllRows =============== -</span>


<span class="org-haskell-operator">&gt;</span> rows <span class="org-haskell-operator">&lt;-</span> fetchAllRows stmt <span class="org-comment-delimiter">-- </span><span class="org-comment">Output changed to fit on the screen.</span>
<span class="org-function-name">rows</span> <span class="org-haskell-operator">::</span> [[<span class="org-haskell-type">SqlValue</span>]]
<span class="org-haskell-operator">&gt;</span> rows
[[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"url"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"http://www.eliza.ch/doc/wadler92essence_of_FP.pdf"</span>]
  ,[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"place"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"Albuquerque, NM, USA"</span>],
   [<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"publisher"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"ACM"</span>],
   [<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"pages"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"1-14"</span>],
   [<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"date"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"1992-00-00 1992"</span>],
   [<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"DOI"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"10.1145/143165.143169"</span>],
   [<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"accessDate"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"2016-04-04 20:05:57"</span>],
   [<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"language"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"en"</span>],
   [<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"title"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"The essence of functional programming"</span>],
   [<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"proceedingsTitle"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"POPL '92 Proceedings of the 19th ACM SIGPLAN-SIGACT symposium on Principles of programming languages"</span>]]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> [[<span class="org-haskell-type">SqlValue</span>]]

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM_</span> print rows
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"url"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"http://www.eliza.ch/doc/wadler92essence_of_FP.pdf"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"place"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"Albuquerque, NM, USA"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"publisher"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"ACM"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"pages"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"1-14"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"date"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"1992-00-00 1992"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"DOI"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"10.1145/143165.143169"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"accessDate"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"2016-04-04 20:05:57"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"language"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"en"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"title"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"The essence of functional programming"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"proceedingsTitle"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"POPL '92 Proceedings of the 19th ACM SIGPLAN-SIGACT symposium on Principles of programming languages"</span>]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> sqlRowToString <span class="org-haskell-operator">=</span> map (fromSql <span class="org-haskell-operator">::</span> <span class="org-haskell-type">SqlValue</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span>)
<span class="org-haskell-operator">-</span> 
<span class="org-function-name">sqlRowToString</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">SqlValue</span>] <span class="org-haskell-operator">-&gt;</span> [<span class="org-haskell-type">String</span>]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM_</span> print <span class="org-haskell-operator">$</span> map sqlRowToString rows 
[<span class="org-string">"url"</span>,<span class="org-string">"http://www.eliza.ch/doc/wadler92essence_of_FP.pdf"</span>]
[<span class="org-string">"place"</span>,<span class="org-string">"Albuquerque, NM, USA"</span>]
[<span class="org-string">"publisher"</span>,<span class="org-string">"ACM"</span>]
[<span class="org-string">"pages"</span>,<span class="org-string">"1-14"</span>]
[<span class="org-string">"date"</span>,<span class="org-string">"1992-00-00 1992"</span>]
[<span class="org-string">"DOI"</span>,<span class="org-string">"10.1145/143165.143169"</span>]
[<span class="org-string">"accessDate"</span>,<span class="org-string">"2016-04-04 20:05:57"</span>]
[<span class="org-string">"language"</span>,<span class="org-string">"en"</span>]
[<span class="org-string">"title"</span>,<span class="org-string">"The essence of functional programming"</span>]
[<span class="org-string">"proceedingsTitle"</span>,<span class="org-string">"POPL '92 Proceedings of the 19th ACM SIGPLAN-SIGACT symposium on Principles of programming languages"</span>]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> sqlRowToLine row <span class="org-haskell-operator">=</span> unwords <span class="org-haskell-operator">$</span> map (fromSql <span class="org-haskell-operator">::</span> <span class="org-haskell-type">SqlValue</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span>) row
<span class="org-haskell-operator">-</span> 
<span class="org-function-name">sqlRowToLine</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">SqlValue</span>] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM_</span> putStrLn <span class="org-haskell-operator">$</span> map sqlRowToLine rows 
<span class="org-haskell-definition">url</span> http<span class="org-haskell-constructor">://</span>www<span class="org-haskell-operator">.</span>eliza<span class="org-haskell-operator">.</span>ch<span class="org-haskell-operator">/</span>doc<span class="org-haskell-operator">/</span>wadler92essence_of_FP<span class="org-haskell-operator">.</span>pdf
<span class="org-haskell-definition">place</span> <span class="org-haskell-constructor">Albuquerque</span>, <span class="org-haskell-constructor">NM</span>, <span class="org-haskell-constructor">USA</span>
<span class="org-haskell-definition">publisher</span> <span class="org-haskell-constructor">ACM</span>
<span class="org-haskell-definition">pages</span> 1<span class="org-haskell-operator">-</span>14
<span class="org-haskell-definition">date</span> 1992<span class="org-haskell-operator">-</span>00<span class="org-haskell-operator">-</span>00 1992
<span class="org-haskell-constructor">DOI</span> 10.1145<span class="org-haskell-operator">/</span>143165.143169
<span class="org-haskell-definition">accessDate</span> 2016<span class="org-haskell-operator">-</span>04<span class="org-haskell-operator">-</span>04 20<span class="org-haskell-constructor">:</span>05<span class="org-haskell-constructor">:</span>57
<span class="org-haskell-definition">language</span> en
<span class="org-haskell-definition">title</span> <span class="org-haskell-constructor">The</span> essence <span class="org-haskell-keyword">of</span> functional programming
<span class="org-haskell-definition">proceedingsTitle</span> <span class="org-haskell-constructor">POPL</span> '92 <span class="org-haskell-constructor">Proceedings</span> <span class="org-haskell-keyword">of</span> the 19th <span class="org-haskell-constructor">ACM</span> <span class="org-haskell-constructor">SIGPLAN</span><span class="org-haskell-operator">-</span><span class="org-haskell-constructor">SIGACT</span> symposium on <span class="org-haskell-constructor">Principles</span> <span class="org-haskell-keyword">of</span> programming languages
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fetchAllRows</span> stmt 
<span class="org-haskell-constructor">[]</span>
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> [[<span class="org-haskell-type">SqlValue</span>]]
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">-- </span><span class="org-comment">================  fetchAllRowsAL  ======================= ---</span>

<span class="org-haskell-operator">&gt;</span> stmt <span class="org-haskell-operator">&lt;-</span> prepare conn query 
<span class="org-function-name">stmt</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Statement</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">execute</span> stmt <span class="org-haskell-constructor">[]</span>
0
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Integer</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> rows <span class="org-haskell-operator">&lt;-</span> fetchAllRowsAL stmt
<span class="org-function-name">rows</span> <span class="org-haskell-operator">::</span> [[(<span class="org-haskell-type">String</span>, <span class="org-haskell-type">SqlValue</span>)]]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM_</span> print rows
[(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"url"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"http://www.eliza.ch/doc/wadler92essence_of_FP.pdf"</span>)]
[(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"place"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"Albuquerque, NM, USA"</span>)]
[(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"publisher"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"ACM"</span>)]
[(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"pages"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"1-14"</span>)]
[(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"date"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"1992-00-00 1992"</span>)]
[(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"DOI"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"10.1145/143165.143169"</span>)]
[(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"accessDate"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"2016-04-04 20:05:57"</span>)]
[(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"language"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"en"</span>)]
[(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"title"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"The essence of functional programming"</span>)]
[(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"proceedingsTitle"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"POPL '92 Proceedings of the 19th ACM SIGPLAN-SIGACT symposium on Principles of programming languages"</span>)]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">=============== fetchAllRowsMap ================== --</span>

<span class="org-haskell-operator">&gt;</span> stmt <span class="org-haskell-operator">&lt;-</span> prepare conn query 
<span class="org-function-name">stmt</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Statement</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">execute</span> stmt <span class="org-haskell-constructor">[]</span>
0

<span class="org-haskell-operator">&gt;</span> rows <span class="org-haskell-operator">&lt;-</span> fetchAllRowsMap stmt
<span class="org-function-name">rows</span> <span class="org-haskell-operator">::</span> [containers<span class="org-haskell-operator">-</span>0.5<span class="org-haskell-operator">.</span>7.1<span class="org-haskell-type">:Data.Map.Base.Map</span> <span class="org-haskell-type">String</span> <span class="org-haskell-type">SqlValue</span>]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM_</span> print rows
<span class="org-haskell-definition">fromList</span> [(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"url"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"http://www.eliza.ch/doc/wadler92essence_of_FP.pdf"</span>)]
<span class="org-haskell-definition">fromList</span> [(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"place"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"Albuquerque, NM, USA"</span>)]
<span class="org-haskell-definition">fromList</span> [(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"publisher"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"ACM"</span>)]
<span class="org-haskell-definition">fromList</span> [(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"pages"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"1-14"</span>)]
<span class="org-haskell-definition">fromList</span> [(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"date"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"1992-00-00 1992"</span>)]
<span class="org-haskell-definition">fromList</span> [(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"DOI"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"10.1145/143165.143169"</span>)]
<span class="org-haskell-definition">fromList</span> [(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"accessDate"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"2016-04-04 20:05:57"</span>)]
<span class="org-haskell-definition">fromList</span> [(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"language"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"en"</span>)]
<span class="org-haskell-definition">fromList</span> [(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"title"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"The essence of functional programming"</span>)]
<span class="org-haskell-definition">fromList</span> [(<span class="org-string">"fieldName"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"proceedingsTitle"</span>),(<span class="org-string">"value"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"POPL '92 Proceedings of the 19th ACM SIGPLAN-SIGACT symposium on Principles of programming languages"</span>)]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>


<p>
Query Item by ID 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-constructor">:</span>{
<span class="org-function-name">queryItemByID</span> <span class="org-haskell-operator">::</span>  <span class="org-haskell-type">IConnection</span> conn <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> conn <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> [[<span class="org-haskell-type">SqlValue</span>]]
<span class="org-haskell-definition">queryItemByID</span> itemID conn <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  stmt <span class="org-haskell-operator">&lt;-</span> prepare conn query
  execute stmt [toSql itemID]
  rows <span class="org-haskell-operator">&lt;-</span> fetchAllRows stmt 
  return rows 
  <span class="org-haskell-keyword">where</span>
    query <span class="org-haskell-operator">=</span> unlines <span class="org-haskell-operator">$</span> [ <span class="org-string">"SELECT fieldName, value FROM itemDataValues, itemData, fields WHERE"</span>, 
                        <span class="org-string">"itemDataValues.valueID = itemData.valueID"</span>, 
                        <span class="org-string">"and itemData.itemID = ?"</span>,
                        <span class="org-string">"and fields.fieldID = itemData.fieldID"</span>
                      ]
<span class="org-haskell-constructor">:</span>}

<span class="org-function-name">queryItemByID</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IConnection</span> conn <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> conn <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> [[<span class="org-haskell-type">SqlValue</span>]]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">queryItemByID</span> 5569 conn <span class="org-haskell-operator">&gt;&gt;=</span> mapM_ print
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"title"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"From Stochastic Calculus to Mathematical Finance-Kabanov.pdf"</span>]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">queryItemByID</span> 5790 conn <span class="org-haskell-operator">&gt;&gt;=</span> mapM_ print
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"url"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"http://twanvl.nl/blog/haskell/building-pipes-with-monad-transformers"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"accessDate"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"2016-04-04 16:45:25"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"title"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"Building pipes with monad transformers"</span>]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">queryItemByID</span> 5805 conn <span class="org-haskell-operator">&gt;&gt;=</span> mapM_ print
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"url"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"http://www.eliza.ch/doc/wadler92essence_of_FP.pdf"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"place"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"Albuquerque, NM, USA"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"publisher"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"ACM"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"pages"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"1-14"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"date"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"1992-00-00 1992"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"DOI"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"10.1145/143165.143169"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"accessDate"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"2016-04-04 20:05:57"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"language"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"en"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"title"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"The essence of functional programming"</span>]
[<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"proceedingsTitle"</span>,<span class="org-haskell-constructor">SqlByteString</span> <span class="org-string">"POPL '92 Proceedings of the 19th ACM SIGPLAN-SIGACT symposium on Principles of programming languages"</span>]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>


<p>
Disconnect 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t disconnect 
<span class="org-function-name">disconnect</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IConnection</span> conn <span class="org-haskell-operator">=&gt;</span> conn <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">disconnect</span> conn
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
