haskell/DatabaseHDBC.html





<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Example - Datbase query with ReaderT monad transformer.</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Note: The type of the monad is <code>ReaderT r m</code> without the parameter of
return value a.
</p>

<ul class="org-ul">
<li>Documentation: <a href="https://hackage.haskell.org/package/mtl-2.2.1/docs/Control-Monad-Reader.html">Control.Monad.Reader</a>
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Signature</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ReaderT r m a</td>
<td class="left">&#xa0;</td>
<td class="left">Encapsulates a function or computation (a -&gt; m b) where m is a monad.</td>
</tr>

<tr>
<td class="left">ReaderT</td>
<td class="left">(r -&gt; m a) -&gt; ReaderT r m a</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">runReaderT</td>
<td class="left">ReaderT r m a -&gt; r -&gt; m a</td>
<td class="left">Run computation and get its value.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">return</td>
<td class="left">a -&gt; (ReaderT r m) a</td>
<td class="left">Monad return function.</td>
</tr>

<tr>
<td class="left">(&gt;&gt;=)</td>
<td class="left">a -&gt; (ReaderT r m) b -&gt; (ReaderT r m) b</td>
<td class="left">Monad bind function.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">fmap</td>
<td class="left">(a -&gt; b) -&gt; (ReaderT r m) a -&gt; (ReaderT r m) b</td>
<td class="left">Apply a function (a -&gt; b) to the result of computation Reader r a.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ask</td>
<td class="left">m r</td>
<td class="left">Read environment or configuration.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">local</td>
<td class="left">(r -&gt; r) -&gt; m a -&gt; m a</td>
<td class="left">Modify environment by applying a function to it.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">liftIO</td>
<td class="left">MonadIO m =&gt; IO a -&gt; m a</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">liftIO</td>
<td class="left">IO a -&gt; (Reader r m) a</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Example: This example will need the database and the haskell packages
shown in  <a href="DatabaseHDBC.html">Databases - HDBC package</a>
</p>


<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span> (mapM_, forM_)
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad.Reader</span> 

<span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">Database.HDBC</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">HDBC</span>
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Database.HDBC.Sqlite3</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">In file add the lines</span>
<span class="org-haskell-pragma">{-# LANGUAGE OverloadedStrings #-}</span>
<span class="org-haskell-pragma">{-# LANGUAGE RankNTypes #-}</span>
<span class="org-haskell-pragma">{-# LANGUAGE FlexibleContexts #-}</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">In the REPL</span>
<span class="org-haskell-constructor">:</span>set <span class="org-haskell-operator">-</span><span class="org-haskell-constructor">XOverloadedStrings</span>
<span class="org-haskell-constructor">:</span>set <span class="org-haskell-operator">-</span><span class="org-haskell-constructor">XRankNTypes</span>

<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">fromSqlToInt</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">HDBC.SqlValue</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">fromSqlToInt</span>  sv <span class="org-haskell-operator">=</span> HDBC.fromSql sv  
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{ 
<span class="org-function-name">fromSqlToString</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">HDBC.SqlValue</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-definition">fromSqlToString</span> sv <span class="org-haskell-operator">=</span> HDBC.fromSql sv 
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-constructor">:</span>{
<span class="org-doc">{- | Convert number to HDBC value -}</span>
<span class="org-function-name">fromIntToHDBC</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">HDBC.SqlValue</span>
<span class="org-haskell-definition">fromIntToHDBC</span> n <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">HDBC.SqlInt64</span> <span class="org-haskell-operator">$</span> fromIntegral n                 
<span class="org-haskell-constructor">:</span>}

 <span class="org-doc">{- | Convert string to HDBC string -}</span>                  
<span class="org-haskell-definition">fromStrToHDBC</span> s <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">HDBC.SqlString</span> s                 


conn <span class="org-haskell-operator">&lt;-</span> connectSqlite3 <span class="org-string">"zotero.sqlite"</span> 


<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">queryItemByIDRaw</span> <span class="org-haskell-operator">::</span>  <span class="org-haskell-type">HDBC.IConnection</span> conn <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> conn <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> [(<span class="org-haskell-type">String</span>, <span class="org-haskell-type">String</span>)]
<span class="org-haskell-definition">queryItemByIDRaw</span> itemID conn <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  stmt <span class="org-haskell-operator">&lt;-</span> HDBC.prepare conn query
  HDBC.execute stmt [HDBC.toSql itemID]
  rows <span class="org-haskell-operator">&lt;-</span> HDBC.fetchAllRows stmt 
  return <span class="org-haskell-operator">$</span> map projection rows 
  <span class="org-haskell-keyword">where</span>
    projection row <span class="org-haskell-operator">=</span> (fromSqlToString <span class="org-haskell-operator">$</span> row <span class="org-haskell-operator">!!</span> 0, fromSqlToString <span class="org-haskell-operator">$</span> row <span class="org-haskell-operator">!!</span> 1)

    query <span class="org-haskell-operator">=</span> unlines <span class="org-haskell-operator">$</span> [ <span class="org-string">"SELECT fieldName, value FROM itemDataValues, itemData, fields WHERE"</span>, 
                        <span class="org-string">"itemDataValues.valueID = itemData.valueID"</span>, 
                        <span class="org-string">"and itemData.itemID = ?"</span>,
                        <span class="org-string">"and fields.fieldID = itemData.fieldID"</span>
                      ]
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t queryItemByIDRaw 10 conn
<span class="org-haskell-definition">queryItemByIDRaw</span> 10 conn <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> [(<span class="org-haskell-type">String</span>, <span class="org-haskell-type">String</span>)]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">queryItemByIDRaw</span> 10 conn
[(<span class="org-string">"url"</span>,<span class="org-string">"http://fsharp.org/specs/language-spec/4.0/FSharpSpec-4.0-latest.pdf"</span>),(<span class="org-string">"accessDate"</span>,<span class="org-string">"2016-11-07 22:00:06"</span>),(<span class="org-string">"title"</span>,<span class="org-string">"FSharpSpec-4.0-latest.pdf"</span>)]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> [(<span class="org-haskell-type">String</span>, <span class="org-haskell-type">String</span>)]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">queryItemByIDRaw</span> 10 conn <span class="org-haskell-operator">&gt;&gt;=</span> mapM_ print
(<span class="org-string">"url"</span>,<span class="org-string">"http://fsharp.org/specs/language-spec/4.0/FSharpSpec-4.0-latest.pdf"</span>)
(<span class="org-string">"accessDate"</span>,<span class="org-string">"2016-11-07 22:00:06"</span>)
(<span class="org-string">"title"</span>,<span class="org-string">"FSharpSpec-4.0-latest.pdf"</span>)
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">queryItemByIDRaw</span> 16 conn <span class="org-haskell-operator">&gt;&gt;=</span> mapM_ print
(<span class="org-string">"url"</span>,<span class="org-string">"http://www.digilife.be/quickreferences/QRC/LINUX%20Admin%20Quick%20Reference.pdf"</span>)
(<span class="org-string">"accessDate"</span>,<span class="org-string">"2016-11-07 22:06:48"</span>)
(<span class="org-string">"title"</span>,<span class="org-string">"linux_quickref.PDF - LINUX Admin Quick Reference.pdf"</span>)
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>


<span class="org-doc">{- | Transform this computation to ReaderT monad with database connection as the </span>
<span class="org-doc">     implicit parameter or configuration. </span>
<span class="org-doc"> -}</span>
<span class="org-haskell-type">:</span>{
<span class="org-function-name">queryItemByID1</span> <span class="org-haskell-operator">::</span>  <span class="org-haskell-type">HDBC.IConnection</span> conn <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">ReaderT</span> conn <span class="org-haskell-type">IO</span> [(<span class="org-haskell-type">String</span>, <span class="org-haskell-type">String</span>)]
<span class="org-haskell-definition">queryItemByID1</span> itemID <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">ReaderT</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-operator">\</span> conn <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">do</span>                      
  stmt <span class="org-haskell-operator">&lt;-</span> liftIO <span class="org-haskell-operator">$</span> HDBC.prepare conn query
  liftIO <span class="org-haskell-operator">$</span> HDBC.execute stmt [HDBC.toSql itemID]
  rows <span class="org-haskell-operator">&lt;-</span> liftIO <span class="org-haskell-operator">$</span> HDBC.fetchAllRows stmt 
  return <span class="org-haskell-operator">$</span> map projection rows 
  <span class="org-haskell-keyword">where</span>
    projection row <span class="org-haskell-operator">=</span> (fromSqlToString <span class="org-haskell-operator">$</span> row <span class="org-haskell-operator">!!</span> 0, fromSqlToString <span class="org-haskell-operator">$</span> row <span class="org-haskell-operator">!!</span> 1)

    query <span class="org-haskell-operator">=</span> unlines <span class="org-haskell-operator">$</span> [ <span class="org-string">"SELECT fieldName, value FROM itemDataValues, itemData, fields WHERE"</span>, 
                        <span class="org-string">"itemDataValues.valueID = itemData.valueID"</span>, 
                        <span class="org-string">"and itemData.itemID = ?"</span>,
                        <span class="org-string">"and fields.fieldID = itemData.fieldID"</span>
                      ]
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t runReaderT
<span class="org-function-name">runReaderT</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">ReaderT</span> r m a <span class="org-haskell-operator">-&gt;</span> r <span class="org-haskell-operator">-&gt;</span> m a

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t queryItemByID1 10
<span class="org-haskell-definition">queryItemByID1</span> 10
  <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IConnection</span> conn <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">ReaderT</span> conn <span class="org-haskell-type">IO</span> [(<span class="org-haskell-type">String</span>, <span class="org-haskell-type">String</span>)]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t runReaderT (queryItemByID1 10) conn 
<span class="org-haskell-definition">runReaderT</span> (queryItemByID1 10) conn <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> [(<span class="org-haskell-type">String</span>, <span class="org-haskell-type">String</span>)]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runReaderT</span> (queryItemByID1 10) conn
[(<span class="org-string">"url"</span>,<span class="org-string">"http://fsharp.org/specs/language-spec/4.0/FSharpSpec-4.0-latest.pdf"</span>),(<span class="org-string">"accessDate"</span>,<span class="org-string">"2016-11-07 22:00:06"</span>),(<span class="org-string">"title"</span>,<span class="org-string">"FSharpSpec-4.0-latest.pdf"</span>)]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> [(<span class="org-haskell-type">String</span>, <span class="org-haskell-type">String</span>)]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runReaderT</span> (queryItemByID1 10) conn <span class="org-haskell-operator">&gt;&gt;=</span> mapM_ print
(<span class="org-string">"url"</span>,<span class="org-string">"http://fsharp.org/specs/language-spec/4.0/FSharpSpec-4.0-latest.pdf"</span>)
(<span class="org-string">"accessDate"</span>,<span class="org-string">"2016-11-07 22:00:06"</span>)
(<span class="org-string">"title"</span>,<span class="org-string">"FSharpSpec-4.0-latest.pdf"</span>)
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">=======================================================================      </span>
<span class="org-doc">{- |  Variation 2 - Simplify - ReaderT conn IO [(String, String)]  -}</span>

<span class="org-doc">{- | Database Connection -&gt; DbConn a = ReaderT conn IO a = conn -&gt; IO a -}</span>
<span class="org-haskell-keyword">type</span> <span class="org-haskell-type">DBConn</span> a <span class="org-haskell-operator">=</span> forall conn<span class="org-haskell-operator">.</span> (<span class="org-haskell-type">HDBC.IConnection</span> conn) <span class="org-haskell-operator">=&gt;</span>  <span class="org-haskell-type">ReaderT</span> conn <span class="org-haskell-type">IO</span> a


<span class="org-haskell-type">:</span>{
<span class="org-function-name">queryItemByID2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">DBConn</span> [(<span class="org-haskell-type">String</span>, <span class="org-haskell-type">String</span>)]
<span class="org-haskell-definition">queryItemByID2</span> itemID <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">ReaderT</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-operator">\</span> conn <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">do</span>                      
  stmt <span class="org-haskell-operator">&lt;-</span> liftIO <span class="org-haskell-operator">$</span> HDBC.prepare conn query
  liftIO <span class="org-haskell-operator">$</span> HDBC.execute stmt [HDBC.toSql itemID]
  rows <span class="org-haskell-operator">&lt;-</span> liftIO <span class="org-haskell-operator">$</span> HDBC.fetchAllRows stmt 
  return <span class="org-haskell-operator">$</span> map projection rows 
  <span class="org-haskell-keyword">where</span>
    projection row <span class="org-haskell-operator">=</span> (fromSqlToString <span class="org-haskell-operator">$</span> row <span class="org-haskell-operator">!!</span> 0, fromSqlToString <span class="org-haskell-operator">$</span> row <span class="org-haskell-operator">!!</span> 1)                    
    query <span class="org-haskell-operator">=</span> unlines <span class="org-haskell-operator">$</span> [ <span class="org-string">"SELECT fieldName, value FROM itemDataValues, itemData, fields WHERE"</span>, 
                        <span class="org-string">"itemDataValues.valueID = itemData.valueID"</span>, 
                        <span class="org-string">"and itemData.itemID = ?"</span>,
                        <span class="org-string">"and fields.fieldID = itemData.fieldID"</span>
                      ]
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t queryItemByID2 10
<span class="org-haskell-definition">queryItemByID2</span> 10
  <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IConnection</span> conn <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">ReaderT</span> conn <span class="org-haskell-type">IO</span> [(<span class="org-haskell-type">String</span>, <span class="org-haskell-type">String</span>)]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runReaderT</span> (queryItemByID2 10) conn
[(<span class="org-string">"url"</span>,<span class="org-string">"http://fsharp.org/specs/language-spec/4.0/FSharpSpec-4.0-latest.pdf"</span>),(<span class="org-string">"accessDate"</span>,<span class="org-string">"2016-11-07 22:00:06"</span>),(<span class="org-string">"title"</span>,<span class="org-string">"FSharpSpec-4.0-latest.pdf"</span>)]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> [(<span class="org-haskell-type">String</span>, <span class="org-haskell-type">String</span>)]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runReaderT</span> (queryItemByID2 10) conn <span class="org-haskell-operator">&gt;&gt;=</span> mapM_ print
(<span class="org-string">"url"</span>,<span class="org-string">"http://fsharp.org/specs/language-spec/4.0/FSharpSpec-4.0-latest.pdf"</span>)
(<span class="org-string">"accessDate"</span>,<span class="org-string">"2016-11-07 22:00:06"</span>)
(<span class="org-string">"title"</span>,<span class="org-string">"FSharpSpec-4.0-latest.pdf"</span>)
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">-- </span><span class="org-comment">=======================================================================      </span>
<span class="org-doc">{- |  Variation 3 - It can be simplified and generalized even further. -}</span>

<span class="org-haskell-keyword">type</span> <span class="org-haskell-type">SQL</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-keyword">type</span> <span class="org-haskell-type">DBConn</span> a <span class="org-haskell-operator">=</span> forall conn<span class="org-haskell-operator">.</span> (<span class="org-haskell-type">HDBC.IConnection</span> conn) <span class="org-haskell-operator">=&gt;</span>  <span class="org-haskell-type">ReaderT</span> conn <span class="org-haskell-type">IO</span> a

<span class="org-haskell-type">:</span>{    
<span class="org-function-name">sqlQueryAll</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">SQL</span> <span class="org-haskell-operator">-&gt;</span> [<span class="org-haskell-type">HDBC.SqlValue</span>] <span class="org-haskell-operator">-&gt;</span> ([<span class="org-haskell-type">HDBC.SqlValue</span>] <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">DBConn</span> [b]     
<span class="org-haskell-definition">sqlQueryAll</span> sql sqlvals projection <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  con     <span class="org-haskell-operator">&lt;-</span> ask 
  stmt    <span class="org-haskell-operator">&lt;-</span> liftIO <span class="org-haskell-operator">$</span> HDBC.prepare con sql
  liftIO  <span class="org-haskell-operator">$</span>  HDBC.execute stmt sqlvals  
  rows    <span class="org-haskell-operator">&lt;-</span> liftIO <span class="org-haskell-operator">$</span> HDBC.fetchAllRows stmt
  return (fmap projection rows)
<span class="org-haskell-constructor">:</span>}



<span class="org-haskell-constructor">:</span>{
<span class="org-function-name">queryItemByID3</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">DBConn</span> [(<span class="org-haskell-type">String</span>, <span class="org-haskell-type">String</span>)]
<span class="org-haskell-definition">queryItemByID3</span> itemID <span class="org-haskell-operator">=</span> sqlQueryAll query [fromIntToHDBC itemID] projection
  <span class="org-haskell-keyword">where</span>
    projection row <span class="org-haskell-operator">=</span> (fromSqlToString <span class="org-haskell-operator">$</span> row <span class="org-haskell-operator">!!</span> 0, fromSqlToString <span class="org-haskell-operator">$</span> row <span class="org-haskell-operator">!!</span> 1)                    
    query <span class="org-haskell-operator">=</span> unlines <span class="org-haskell-operator">$</span> [ <span class="org-string">"SELECT fieldName, value FROM itemDataValues, itemData, fields WHERE"</span>, 
                        <span class="org-string">"itemDataValues.valueID = itemData.valueID"</span>, 
                        <span class="org-string">"and itemData.itemID = ?"</span>,
                        <span class="org-string">"and fields.fieldID = itemData.fieldID"</span>
                      ]
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runReaderT</span> (queryItemByID3 10) conn
[(<span class="org-string">"url"</span>,<span class="org-string">"http://fsharp.org/specs/language-spec/4.0/FSharpSpec-4.0-latest.pdf"</span>),(<span class="org-string">"accessDate"</span>,<span class="org-string">"2016-11-07 22:00:06"</span>),(<span class="org-string">"title"</span>,<span class="org-string">"FSharpSpec-4.0-latest.pdf"</span>)]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> [(<span class="org-haskell-type">String</span>, <span class="org-haskell-type">String</span>)]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runReaderT</span> (queryItemByID3 10) conn <span class="org-haskell-operator">&gt;&gt;=</span> mapM_ print
(<span class="org-string">"url"</span>,<span class="org-string">"http://fsharp.org/specs/language-spec/4.0/FSharpSpec-4.0-latest.pdf"</span>)
(<span class="org-string">"accessDate"</span>,<span class="org-string">"2016-11-07 22:00:06"</span>)
(<span class="org-string">"title"</span>,<span class="org-string">"FSharpSpec-4.0-latest.pdf"</span>)
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>

<span class="org-doc">-- | Get all tags associated with a given item</span>
<span class="org-haskell-type">:</span>{
<span class="org-function-name">getItemTags</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">DBConn</span> [(<span class="org-haskell-type">Int</span>, <span class="org-haskell-type">String</span>)]
<span class="org-haskell-definition">getItemTags</span> itemID <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>  
  sqlQueryAll sql [fromIntToHDBC itemID] projection
  <span class="org-haskell-keyword">where</span>
    sql <span class="org-haskell-operator">=</span> unlines [<span class="org-string">"SELECT  tags.tagID, tags.name"</span>,
                   <span class="org-string">"FROM    itemTags, tags"</span>, 
                   <span class="org-string">"WHERE   itemTags.tagID = tags.tagID"</span>, 
                   <span class="org-string">"AND     itemID = ?"</span>
                   ]

    projection xs <span class="org-haskell-operator">=</span> (fromSqlToInt (xs <span class="org-haskell-operator">!!</span> 0), fromSqlToString (xs <span class="org-haskell-operator">!!</span> 1))
<span class="org-haskell-constructor">:</span>}


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runReaderT</span> (getItemTags 12) conn
[(2,<span class="org-string">"fp"</span>),(3,<span class="org-string">"fsharp"</span>),(4,<span class="org-string">"doc"</span>),(5,<span class="org-string">"overview"</span>)]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> [(<span class="org-haskell-type">Int</span>, <span class="org-haskell-type">String</span>)]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runReaderT</span> (getItemTags 13) conn
[(2,<span class="org-string">"fp"</span>),(3,<span class="org-string">"fsharp"</span>),(4,<span class="org-string">"doc"</span>)]
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> [(<span class="org-haskell-type">Int</span>, <span class="org-haskell-type">String</span>)]
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-type">:</span>{
<span class="org-function-name">showItem</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">DBConn</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">showItem</span> itemID <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>
  itemData <span class="org-haskell-operator">&lt;-</span> queryItemByID3 itemID  
  tags   <span class="org-haskell-operator">&lt;-</span> getItemTags itemID

  <span class="org-comment-delimiter">-- </span><span class="org-comment">liftIO :: IO () =&gt; DBConn ()          </span>
  liftIO <span class="org-haskell-operator">$</span> <span class="org-haskell-keyword">do</span>
    putStrLn <span class="org-string">"Item Data"</span>
    putStrLn <span class="org-string">"---------------------------"</span>             
    forM_ itemData print
    putStrLn <span class="org-string">"Item Tags"</span>
    putStrLn <span class="org-string">"---------------------------"</span>
    forM_ tags print     
<span class="org-haskell-constructor">:</span>}   

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runReaderT</span> (showItem 12) conn
<span class="org-haskell-constructor">Item</span> <span class="org-haskell-constructor">Data</span>
<span class="org-comment-delimiter">--</span><span class="org-comment">-------------------------</span>
(<span class="org-string">"url"</span>,<span class="org-string">"http://tomasp.net/articles/fsharp-i-introduction/article.pdf"</span>)
(<span class="org-string">"accessDate"</span>,<span class="org-string">"2016-11-07 22:01:04"</span>)
(<span class="org-string">"title"</span>,<span class="org-string">"F# Language Overview"</span>)
<span class="org-haskell-constructor">Item</span> <span class="org-haskell-constructor">Tags</span>
<span class="org-comment-delimiter">--</span><span class="org-comment">-------------------------</span>
(2,<span class="org-string">"fp"</span>)
(3,<span class="org-string">"fsharp"</span>)
(4,<span class="org-string">"doc"</span>)
(5,<span class="org-string">"overview"</span>)
<span class="org-function-name">it</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">runReaderT</span> (showItem 13) conn
<span class="org-haskell-constructor">Item</span> <span class="org-haskell-constructor">Data</span>
<span class="org-comment-delimiter">--</span><span class="org-comment">-------------------------</span>
(<span class="org-string">"url"</span>,<span class="org-string">"http://fsharp.org/specs/language-spec/4.0/FSharpSpec-4.0-latest.pdf"</span>)
(<span class="org-string">"accessDate"</span>,<span class="org-string">"2016-11-07 22:00:06"</span>)
(<span class="org-string">"title"</span>,<span class="org-string">"The F# 4.0 Language Specification"</span>)
<span class="org-haskell-constructor">Item</span> <span class="org-haskell-constructor">Tags</span>
<span class="org-comment-delimiter">--</span><span class="org-comment">-------------------------</span>
(2,<span class="org-string">"fp"</span>)
(3,<span class="org-string">"fsharp"</span>)
(4,<span class="org-string">"doc"</span>)
<span class="org-function-name">it</span> <span class="org-haskell-definition">:</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: nobody</p>
<p class="date">Created: 2018-05-07 Mon 10:11</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
